app/Controllers/Auth.php

UPDATE `users` SET `last_login_at` = '2026-09-16 11:55:15', `updated_at` = '2026-09-16 11:55:15'
WHERE `users`.`id` IN ('1')
---
            'must_change_password'  => (bool) $user['must_change_password'],
        ]);

        $this->userModel->update($user['id'], ['last_login_at' => date('Y-m-d H:i:s')]);