app/Controllers/Beranda.php

SELECT COUNT(*) AS `numrows`
FROM `pegawai`
WHERE `kategori` = 'pusat'
AND `pegawai`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `pegawai`
WHERE `kategori` = 'daerah'
AND `pegawai`.`deleted_at` IS NULL
---
    public function index()
    {
        $pegawaiModel = new \App\Models\PegawaiModel();

        return view('beranda/index', [
            'title'        => 'Beranda — SINDAK',
            'totalPusat'   => $pegawaiModel->where('kategori', 'pusat')->countAllResults(),
            'totalDaerah'  => $pegawaiModel->where('kategori', 'daerah')->countAllResults(),