app/Controllers/Pegawai.php

SELECT COUNT(*) AS `numrows`
FROM `pegawai`
LEFT JOIN `level_jabatan` ON `level_jabatan`.`id` = `pegawai`.`level_jabatan_id`
LEFT JOIN `pangkat` ON `pangkat`.`id` = `pegawai`.`pangkat_id`
LEFT JOIN `golongan_ruang` ON `golongan_ruang`.`id` = `pegawai`.`golongan_ruang_id`
LEFT JOIN `tampil_jabatan` ON `tampil_jabatan`.`id` = `pegawai`.`tampil_jabatan_id`
LEFT JOIN `unit_kerja` ON `unit_kerja`.`id` = `pegawai`.`unit_kerja_id`
LEFT JOIN `satuan_kerja` ON `satuan_kerja`.`id` = `pegawai`.`satuan_kerja_id`
LEFT JOIN `satuan_kerja_2` ON `satuan_kerja_2`.`id` = `pegawai`.`satuan_kerja_2_id`
LEFT JOIN `provinsi` ON `provinsi`.`id` = `pegawai`.`provinsi_id`
LEFT JOIN `kabupaten_kota` ON `kabupaten_kota`.`id` = `pegawai`.`kabupaten_kota_id`
WHERE `pegawai`.`kategori` = 'daerah'
AND `pegawai`.`deleted_at` IS NULL
SELECT `pegawai`.*, `level_jabatan`.`nama` AS `level_jabatan_nama`, `pangkat`.`nama` AS `pangkat_nama`, `golongan_ruang`.`nama` AS `golongan_ruang_nama`, `tampil_jabatan`.`nama` AS `tampil_jabatan_nama`, `unit_kerja`.`nama` AS `unit_kerja_nama`, `satuan_kerja`.`nama` AS `satuan_kerja_nama`, `satuan_kerja_2`.`nama` AS `satuan_kerja_2_nama`, `provinsi`.`nama` AS `provinsi_nama`, `kabupaten_kota`.`nama` AS `kabupaten_kota_nama`
FROM `pegawai`
LEFT JOIN `level_jabatan` ON `level_jabatan`.`id` = `pegawai`.`level_jabatan_id`
LEFT JOIN `pangkat` ON `pangkat`.`id` = `pegawai`.`pangkat_id`
LEFT JOIN `golongan_ruang` ON `golongan_ruang`.`id` = `pegawai`.`golongan_ruang_id`
LEFT JOIN `tampil_jabatan` ON `tampil_jabatan`.`id` = `pegawai`.`tampil_jabatan_id`
LEFT JOIN `unit_kerja` ON `unit_kerja`.`id` = `pegawai`.`unit_kerja_id`
LEFT JOIN `satuan_kerja` ON `satuan_kerja`.`id` = `pegawai`.`satuan_kerja_id`
LEFT JOIN `satuan_kerja_2` ON `satuan_kerja_2`.`id` = `pegawai`.`satuan_kerja_2_id`
LEFT JOIN `provinsi` ON `provinsi`.`id` = `pegawai`.`provinsi_id`
LEFT JOIN `kabupaten_kota` ON `kabupaten_kota`.`id` = `pegawai`.`kabupaten_kota_id`
WHERE `pegawai`.`kategori` = 'daerah'
AND `pegawai`.`deleted_at` IS NULL
ORDER BY `pegawai`.`id` ASC
 LIMIT 25
SELECT *
FROM `unit_kerja`
WHERE `nama` = 'Direktorat Jenderal Bimbingan Masyarakat Kristen'
 LIMIT 1
---
    public function index()
    {
        $kategori = $this->request->getGet('kategori') ?? 'pusat';
        if (! in_array($kategori, ['pusat', 'daerah'], true)) {
            $kategori = 'pusat';
        }

        $perPage = (int) $this->request->getGet('per_page');
        if (! in_array($perPage, self::PER_PAGE_OPTIONS, true)) {
            $perPage = self::DEFAULT_PER_PAGE;
        }

        // Ambil hanya parameter filter yang dikenali & tidak kosong.
        $filters = [];
        foreach (PegawaiModel::filterKeys() as $key) {
            $val = $this->request->getGet($key);
            if (is_string($val) && $val !== '') {
                $filters[$key] = $val;
            }
        }
        // Unit Kerja untuk pegawai pusat selalu sama (Ditjen), tidak difilter.
        if ($kategori === 'pusat') {
            unset($filters['unit_kerja_id']);
        }

        $daftarPegawai = $this->pegawaiModel->listQuery($kategori, $filters)->paginate($perPage);
        $pager         = $this->pegawaiModel->pager;

        // Data untuk dropdown filter -------------------------------------
        $unitKerjaModel = new LookupModel('unit_kerja');
        $pusatUnit = $unitKerjaModel->where('nama', PegawaiModel::UNIT_KERJA_PUSAT)->first();