app/Controllers/Pegawai.php

    public function store()
    {
        $data = $this->extractPegawaiInput();

        // insert() otomatis menjalankan $validationRules yang ada di
        // PegawaiModel (termasuk cek NIP 18 digit & unik).
        if (! $this->pegawaiModel->insert($data)) {
---
INSERT INTO `pegawai` (`nip`, `nama_lengkap`, `kategori`, `agama`, `jenis_kelamin`, `jenjang_pendidikan`, `status_pegawai`, `level_jabatan_id`, `pangkat_id`, `golongan_ruang_id`, `tipe_jabatan_id`, `tampil_jabatan_id`, `unit_kerja_id`, `satuan_kerja_id`, `satuan_kerja_2_id`, `provinsi_id`, `kabupaten_kota_id`, `tmt_cpns`, `tmt_pangkat`, `created_at`, `updated_at`) VALUES ('121234345656787890', 'Dummy Pegawai', 'pusat', 'Kristen', 'L', 'S1', 'PNS', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2025-01-01', '2026-01-01', '2026-09-16 13:45:45', '2026-09-16 13:45:45')

    public function edit(int $id)
    {
        $pegawai = $this->pegawaiModel->find($id);
---
SELECT *
FROM `pegawai`
WHERE `pegawai`.`deleted_at` IS NULL
AND `pegawai`.`id` = 1

    public function update(int $id)
    {
        $pegawai = $this->pegawaiModel->find($id);

        if (! $pegawai) {
            return redirect()->to('/admin/pegawai')->with('error', 'Data pegawai tidak ditemukan.');
        }

        $data = $this->extractPegawaiInput();

        // Passing $id ke update() supaya placeholder {id} di rule
        // is_unique[pegawai.nip,id,{id}] otomatis terisi benar —
        // mengecualikan baris pegawai ini sendiri dari cek keunikan NIP.
        if (! $this->pegawaiModel->update($id, $data)) {
---
SELECT *
FROM `pegawai`
WHERE `pegawai`.`deleted_at` IS NULL
AND `pegawai`.`id` = 1
UPDATE `pegawai` SET `nip` = '121234345656787890', `nama_lengkap` = 'Dummy Pegawai', `kategori` = 'pusat', `agama` = 'Kristen', `jenis_kelamin` = 'L', `jenjang_pendidikan` = 'S1', `status_pegawai` = 'PNS', `level_jabatan_id` = NULL, `pangkat_id` = NULL, `golongan_ruang_id` = NULL, `tipe_jabatan_id` = NULL, `tampil_jabatan_id` = NULL, `unit_kerja_id` = NULL, `satuan_kerja_id` = NULL, `satuan_kerja_2_id` = NULL, `provinsi_id` = NULL, `kabupaten_kota_id` = NULL, `tmt_cpns` = '2024-06-01', `tmt_pangkat` = '2025-08-01', `updated_at` = '2026-09-21 08:31:36'
WHERE `pegawai`.`id` IN (1)