app/Models/LoginAttemptModel.php

INSERT INTO `login_attempts` (`username`, `ip_address`, `is_success`, `attempted_at`) VALUES ('200010232025051007', '::1', 1, '2026-09-16 11:55:15')
---
    public function record(string $username, string $ipAddress, bool $isSuccess): void
    {
        $this->insert([
            'username'     => $username,
            'ip_address'   => $ipAddress,
            'is_success'   => $isSuccess ? 1 : 0,
            'attempted_at' => date('Y-m-d H:i:s'),
        ]);

SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `username` = '200010232025051007'
AND `is_success` = 0
AND `attempted_at` >= '2026-09-16 11:50:15'
SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `ip_address` = '::1'
AND `is_success` = 0
AND `attempted_at` >= '2026-09-16 11:50:15'
---
    public function isLockedOut(string $username, string $ipAddress): bool
    {
        $since = date('Y-m-d H:i:s', strtotime('-' . self::WINDOW_MINUTES . ' minutes'));

        $failedByUsername = $this->where('username', $username)
            ->where('is_success', 0)
            ->where('attempted_at >=', $since)
            ->countAllResults();

        $failedByIp = $this->where('ip_address', $ipAddress)
            ->where('is_success', 0)
            ->where('attempted_at >=', $since)
            ->countAllResults();