app/Models/PegawaiModel.php

    public function tmtYears(string $kolom, string $kategori): array
    {
        if (! in_array($kolom, self::YEAR_FILTERS, true)) {
            return [];
        }

        $rows = $this->db->table('pegawai')
            ->select("DISTINCT YEAR({$kolom}) AS tahun", false)
            ->where('kategori', $kategori)
            ->where('deleted_at IS NULL', null, false)
            ->where("{$kolom} IS NOT NULL", null, false)
            ->orderBy('tahun', 'DESC')
            ->get()->getResultArray();
---
SELECT DISTINCT YEAR(tmt_pangkat) AS tahun
FROM `pegawai`
WHERE `kategori` = 'daerah'
AND deleted_at IS NULL
AND tmt_pangkat IS NOT NULL
ORDER BY `tahun` DESC