app/Models/PegawaiModel.php

    public function findByKategori(string $kategori): array
    {
        return $this->select('
                pegawai.*,
                level_jabatan.nama as level_jabatan_nama,
                pangkat.nama as pangkat_nama,
                golongan_ruang.nama as golongan_ruang_nama,
                unit_kerja.nama as unit_kerja_nama,
                provinsi.nama as provinsi_nama,
                kabupaten_kota.nama as kabupaten_kota_nama
            ')
            ->join('level_jabatan', 'level_jabatan.id = pegawai.level_jabatan_id', 'left')
            ->join('pangkat', 'pangkat.id = pegawai.pangkat_id', 'left')
            ->join('golongan_ruang', 'golongan_ruang.id = pegawai.golongan_ruang_id', 'left')
            ->join('unit_kerja', 'unit_kerja.id = pegawai.unit_kerja_id', 'left')
            ->join('provinsi', 'provinsi.id = pegawai.provinsi_id', 'left')
            ->join('kabupaten_kota', 'kabupaten_kota.id = pegawai.kabupaten_kota_id', 'left')
            ->where('pegawai.kategori', $kategori)
            ->findAll();
---
SELECT `pegawai`.*, `level_jabatan`.`nama` as `level_jabatan_nama`, `pangkat`.`nama` as `pangkat_nama`, `golongan_ruang`.`nama` as `golongan_ruang_nama`, `unit_kerja`.`nama` as `unit_kerja_nama`, `provinsi`.`nama` as `provinsi_nama`, `kabupaten_kota`.`nama` as `kabupaten_kota_nama`
FROM `pegawai`
LEFT JOIN `level_jabatan` ON `level_jabatan`.`id` = `pegawai`.`level_jabatan_id`
LEFT JOIN `pangkat` ON `pangkat`.`id` = `pegawai`.`pangkat_id`
LEFT JOIN `golongan_ruang` ON `golongan_ruang`.`id` = `pegawai`.`golongan_ruang_id`
LEFT JOIN `unit_kerja` ON `unit_kerja`.`id` = `pegawai`.`unit_kerja_id`
LEFT JOIN `provinsi` ON `provinsi`.`id` = `pegawai`.`provinsi_id`
LEFT JOIN `kabupaten_kota` ON `kabupaten_kota`.`id` = `pegawai`.`kabupaten_kota_id`
WHERE `pegawai`.`kategori` = 'pusat'
AND `pegawai`.`deleted_at` IS NULL