app/Models/UserModel.php

    public function findByUsernameWithRole(string $username): ?array
    {
        $user = $this->select('users.*, roles.name as role_name, roles.label as role_label')
            ->join('roles', 'roles.id = users.role_id')
            ->where('users.username', $username)
            ->where('users.is_active', 1)
            ->first();
---
SELECT `users`.*, `roles`.`name` as `role_name`, `roles`.`label` as `role_label`
FROM `users`
JOIN `roles` ON `roles`.`id` = `users`.`role_id`
WHERE `users`.`username` = '200010232025051007'
AND `users`.`is_active` = 1
AND `users`.`deleted_at` IS NULL
 LIMIT 1